{"meta":{"title":"stegenfeldt","subtitle":"Static. Nothing but static.","description":"Currently, this is nothing more than a playground for a dynamically generated static website.","author":"Samuel Tegenfeldt","url":"http://stegenfeldt.github.io"},"pages":[{"title":"About","date":"2016-05-17T22:20:57.000Z","updated":"2016-05-17T22:26:44.711Z","comments":true,"path":"About/index.html","permalink":"http://stegenfeldt.github.io/About/index.html","excerpt":"","keywords":null,"text":"Who’s stegenfeldt?A System Management consultant at Atea Sverige AB, Swedish, focusing mainly on System Center Operations Manager, System Center Service Manager some Microsoft SQL Server and OP5.Besides doing consulting I am also an MCT and are holding both the official System Center Operations Manager courses at Cornerstone and Global Knowledge and holds customized classes at customer sites. The content of this site consists of my own personal opinions (and occasionally the opinions of others) and does not officially represent my employer’s view in anyway. Included content is especially not intended to convey the views of Atea Sverige AB. Please visit www.atea.com for official information. In addition, the thoughts and opinions of participants often change, and as a weblog, this is intended to provide a semi-permanent point in time snapshot. You should not consider out of date posts to reflect participants current thoughts and opinions.","raw":null,"content":null}],"posts":[{"title":"Hehrle wherlhd","slug":"hello-world","date":"2016-05-17T20:35:07.318Z","updated":"2016-05-17T22:56:52.631Z","comments":true,"path":"Technobabble/hello-world/","link":"","permalink":"http://stegenfeldt.github.io/Technobabble/hello-world/","excerpt":"","keywords":null,"text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","raw":null,"content":null,"categories":[{"name":"Technobabble","slug":"Technobabble","permalink":"http://stegenfeldt.github.io/topics/Technobabble/"}],"tags":[]}]}